{"Dolmenwood/Ability-Scores":{"slug":"Dolmenwood/Ability-Scores","filePath":"Dolmenwood/Ability Scores.md","title":"Ability Scores","links":[],"tags":[],"content":"Modifiers\nAbility scores add (or subtract) modifiers to damage rolls.\nThe modifier is calculated (ability score - 10)/2\nFor ability scores above 12 or above, this will result in a positive modifier. For ability scores 8 or below, this will result in a negative modifier.\nModifiers are rounded to the smallest absolute value, i.e. -1 rounds to 0, +1 rounds to 0. -2 rounds to -1, +2 rounds to +1.\nAdd the STR modifier to melee damage for slow (d10), and balanced (d8) weapons.\nAdd the DEX modifier to melee damage for quick (d6) weapons and ranged attacks.\nUnarmed and improvised (1d4)  may use either STR or DEX modifiers, but not both.\nAdd the WIL modifier to the SUM of spell rolls, and rolls to avoid spell miscasts."},"Dolmenwood/Armor":{"slug":"Dolmenwood/Armor","filePath":"Dolmenwood/Armor.md","title":"Armor","links":[],"tags":[],"content":"Light Armor\ne.g. Leather\n1 armor\nMedium Armor\ne.g. Chain mail\n2 armor, 2 Slots\nHeavy Armor\ne.g. Plate mail\n3 armor, 2 Slots, prevents dodging\nShields\nEnable blocking, and can be sacrificed to ignore an incoming\nattack.\nHelmets\nCan negate injuries from failed Critical Damage Saves"},"Dolmenwood/Character-Creation":{"slug":"Dolmenwood/Character-Creation","filePath":"Dolmenwood/Character Creation.md","title":"Character Creation","links":["Dolmenwood/Vocations"],"tags":[],"content":"Roll ability scores\nRoll 3d6 three times. Assign each total to one of the ability scores of your choice, STR, DEX and WIl. Enter the numbers in the ‘MAX’ box.\nRoll 1d4 and add 10 to get LUCK\nAdd Modifiers\nFor each of the three stats, enter the modifier in the MOD column. The modifier is the (stat - 10) /2\nFor each stat this will give you a modifier between -4 and +4.\nChoose a Vocation\nChoose one of the Vocations for your character: Cleric, Hunter, Knight, Magician or Thief.\nWeapons and Armor\nRoll for armor and weapons using the list in your vocation description. Write them in the “On person” section of your character sheet. Most equipment occupies one slot (box) on the character sheet. Some equipment takes more than one slot. Some equipment takes no slots. Anything that takes 0 slots goes in the ‘Skills, Spells, etc.’ section.\nEquipment, Skills and Spells\nAdd the equipment listed in your vocation to either the “on person” section or to your backpack. During combat it takes one action to move an item (or swap two items) from in your backpack to on your person.\nAdd any class skills or spells\nHit Protection (HP)\nRoll the listed die type for your vocation, put it in the MAX Hp box\nMotivation\nPick which of these motivations best suits your character:\n\nHelping people\nUncovering mysteries\nSeeking treasure\n"},"Dolmenwood/Combat":{"slug":"Dolmenwood/Combat","filePath":"Dolmenwood/Combat.md","title":"Combat","links":[],"tags":[],"content":"Before damage is rolled, Player Characters under attack have the following options:\nDefend\nThe character tries to defend themselves without taking any particular risks\nor trying any moves. This is resolved by simply taking the damage to HP — the default\noption.\nFight Back\nThe defender chooses one attacker and makes an attack, after they’ve\ntaken the incoming damage. Fighting back incurs 1 Fatigue.\nBlock\nIncoming Fast (d6) or Balanced (d8) attacks become Impaired. To block, the\ndefender must wield a balanced or slow weapon or a shield. Blocking incurs 1\nFatigue, unless it is performed with a shield or slow weapon while wearing heavy\narmor (3 Armor), in which case it incurs no Fatigue.\nDodge\nAny incoming Slow (d10) or Balanced (d8) attacks become Impaired. It is not\npossible to dodge in heavy armor (3 Armor) or while wielding a slow weapon.\nDodging incurs 1 Fatigue, unless it is performed with a fast weapon (or unarmed)\nwhile wielding light (1 Armor) or no Armor, in which case it incurs no Fatigue.\nParry\nThe defender chooses one attacking opponent that they are able to attack in\nreturn and make an opposed roll.\n\nIf the defender rolls higher than the attacker, the attacker’s dice\nroll is invalidated, and the defender deals their damage straight to the attacker’s\nSTR.\nIf the attacker rolls higher, the damage is dealt to the defender’s STR instead.\nIf the two rolls are equal, both weapons bounce off each other. No damage is done to either party.\n\nEach of these options is essentially a reaction — they happen in the split-second in\nwhich a character is attacked. Some enemies might also have access to these abilities\nas well. Note that an attacking creature cannot take a reaction; if an orc blademaster\nstrikes at a PC and the PC fights back, the orc cannot block or take similar reactions, as\nthat could create an infinite chain of reactions.\nDamage\nHP represents the character’s ability to avoid harm. While the character is at or above 0 HP, they have not be physically harmed.\nOnce a character’s HP have been depleted, any additional damage is done to their STR stat. Once the damage"},"Dolmenwood/Magic":{"slug":"Dolmenwood/Magic","filePath":"Dolmenwood/Magic.md","title":"Magic","links":["magical-mishap-table"],"tags":[],"content":"Decide how many dice you are going to use to cast your spell. Some spells may have a minimum number of dice that you must use to successfully cast the spell. The maximum number of dice that a beginning character can use is four. You cannot use more dice than you have empty inventory slots. To use more than four dice the character must get specialized training, or find some other in-game method to increase ability their to use magic.\nSpell Descriptions\nSome spells have variable effects based on the number and sum of the dice. In the descriptions these will be noted as SUM and DICE.\nRolling the dice\nRoll the selected number of magic dice. If any of the dice are repeated (i.e. two 4s, three 2s, two 2s and two sixes), then the spell has become unstable and the caster must roll to control it.\nTo successfully control the spell: Roll a WIL check against a target of 12 + the number of matching dice.\nExample: Zappa is attempting to cast a three die fireball. They roll a 6 and two 1s. Zappa must make a WIL check (WIL + d20) and beat a target number of 14 (12 + 2 for the repeated 1s).\nIf the check is failed, the player must roll on the magical mishap table.\nMagical mishaps do not always result in the failure of the spell.\nFatigue\nWhether the spell is successfully cast or not, the character takes one fatigue for each 4,5 or 6 rolled.\nHoly magic is incompatible with other types of magic\nAny character that has access to holy magic (cleric spells), may not use arcane or other types of magic. If they do, their deity will remove their ability to cast holy spells, or to receive holy blessings\nThe ability to cast holy magic may be regained by performing a service for the church as penance.\nLimited exceptions may be made if the use of arcane magic is of significant benefit to the church."},"Dolmenwood/Mechanics":{"slug":"Dolmenwood/Mechanics","filePath":"Dolmenwood/Mechanics.md","title":"Mechanics","links":[],"tags":[],"content":"Checks\nRoll 1d20 and add your modifier. The DM will tell you if you succeed or not.\nA roll of a natural 20 can indicate a Critical Success (yes, and). A natural one can indicate an exceptional failure (no, and), also called a Fumble.\nModifiers\nAbility scores add (or subtract) modifiers to damage rolls.\nThe modifier is calculated (ability score - 10)/2\nFor ability scores above 12 or above, this will result in a positive modifier. For ability scores 8 or below, this will result in a negative modifier.\nModifiers are rounded to the smallest absolute value, i.e. -1 rounds to 0, +1 rounds to 0. -2 rounds to -1, +2 rounds to +1.\nAdd the STR modifier to melee damage for slow (d10), and balanced (d8) weapons.\nAdd the DEX modifier to melee damage for quick (d6) weapons and ranged attacks.\nUnarmed and improvised (1d4)  may use either STR or DEX modifiers, but not both.\nAdd the WIL modifier to the SUM of spell rolls, and rolls to avoid spell miscasts.\nSaves\nMake a roll-under save to avoid a bad thing happening. This system is similar to games like Cairn, or 1st and 2nd edition Dungeons and Dragons.\nIf a character is at risk, the DM will call for a save against the relevant stat. The player rolls 1d20, and is aiming to roll equal or lower than their ability score."},"Dolmenwood/Session-0":{"slug":"Dolmenwood/Session-0","filePath":"Dolmenwood/Session 0.md","title":"Session 0","links":["Dolmenwood/Vocations"],"tags":[],"content":"Principles\nLiving World\nTheir is no set plot, and the players are free to follow what interests them. All of the factions have their own desires and plans, and will attempt to fulfill them. The players may choose to help or hinder them as they see fit.\nForeground growth and levelling\nThere is no explicit levelling, where a character gets a jump in abilities after beating a number of monsters or accumulating an amount of gold. Characters advance through interacting with the game world, having adventures and pursuing their own goals.\nCombat as war, not as sport\nThere is no explicit reward for killing monsters or NPCs. Combat is deadly and unpredictable. If you have no choice but to use physical violence, stack the odds in your favor. Set traps and ambushes. Never fight fair.\nCharacter creation\nVocations over Classes\nWe are not playing with traditional classes. Players should choose one of the Vocations that offer skills and starting equipment. Characters are not tied to their vocation. If they wish they may follow another vocation through training and interest, or forge something completely unique.\nUnlocking kindreds\nAll starting characters are going to be human. As the players encounter the different sentient species in the Dolmenwood, they will be able to create characters who belong to them.\nTroupe Play\nPlayers start off with one character. Their may be times when their character is unavailable to be played (injured, occupied with a project, in a different location etc.). In this case it is useful for a player to have other characters available to play. Hirelings, apprentices, and friendly NPCs are all good options to play until the main character is available again.\nCharacter Advancement\nGold is a good proxy for XP\nWhile their is no explicit XP or leveling, attaining gold can be a route to increasing character power and capabilities. Characters can:\n\nPay for training to increase stats, HP and skills\nPurchase magic items\nUse gold to curry favor and gain influence with factions\nHire underlings or mercenaries, build fortifications, research technology\n\nMagic is out in the world\nMagic using characters do not get to pick spells from a list during advancement. Magic can be gained is a few different ways:\n\nFinding scrolls and transcribing them into a spell book\nPaying a more powerful magic user to teach them a spell\nGaining spells or magical items in exchange for performing services\nPraying one of the many shrines to receive a blessing in the form of a new spell\n\nTraining\nMore mundane skills can be acquired through training with a proficient teacher. Some rough guidelines:\nBecome basically proficient: 1 month, 250GP, can learn from anyone proficient in the skill.\nAdvanced proficiency: 3 months  500GP, must find a dedicated teacher.\nExpert proficiency: 6 months, 1000GP, must find a renowned teacher.\nOne of the greats in the field, 1 year or more, 2000GP or more, will have to undertake quests, must find a legend in the field willing to teach them.\nThese are cumulative, so to become an expert at horse riding would take 9 months of dedicated study, cost 1750GP, and require finding an expert at horsemanship to teach them."},"Dolmenwood/Vocations":{"slug":"Dolmenwood/Vocations","filePath":"Dolmenwood/Vocations.md","title":"Vocations","links":[],"tags":[],"content":"Cleric\nFor this campaign your character will start as a cleric of the Pluritine Church. Your character has yet to earn the right to join one of the holy orders.\nd6HP\nStarting equipment\nArmour: (roll 1d6):\n1 Leather.\n2 Leather + shield.\n3 Chainmail(2 Slots).\n4 Chainmail(2 Slots) + shield.\n5 Plate mail(2 Slots).\n6 Plate mail(2 Slots) + shield.\nWeapons: (roll 1d6 twice):\n1 Dagger.\n2 Longsword.\n3 Mace.\n4 Shortbow + 20 arrows.\n5 Shortsword.\n6 Warhammer (2 Slots).\nClass items:\nWooden holy symbol\nBasic Items\nRations (3 uses)\nTorches (3 uses)\nBandages (3 uses)\ntinder box (0 slots)\nSkills\nDetect holy magic\nTurn undead\nMagic\nA rank 1 holy spell (choose one or roll 1d8)\n1 Detect Evil\n2 Detect Magic\n3 Frost Ward\n4 Lesser Healing\n5 Light\n6 Mantle of Protection\n7 Purify Food and Drink\n8 Rally\nHunter\nYou character may start with a simple animal companion (dog, cat, hawk, snake, weasel etc.) or take one automatic success on establishing a connection with a wild animal during play.\nAnimal companions understand simple commands, and will fight to defend the hunter if threatened.\nd8 HP\nStarting equipment\nArmour (roll 1d6):\n1–3 Leather armour.\n4–6 Leather armour + shield.\nWeapons (roll 1d6 twice):\n1 Dagger.\n2 Longsword.\n3–4 Longbow(2 Slots) + 20 arrows.\n5 Shortsword\n6 Sling + 20 stones.\nBasic Equipment\nFirewood(2 Slots, 6 hours)\nTent\nlarge trap\ntinder box (0 slots)\nSkills\nAnimal Companion\nHunting skills (tracking, navigating etc.)\nKnight\nFor this campaign your character will start as a squire of house Harrowmoor. Your character has yet to earn their knighthood.\nd8HP\nStarting equipment\nArmour (roll 1d6):\n1 Chainmail\n2–3 Chainmail + shield\n4 Plate Mail(2 Slots)\n5–6 Plate Mail (2 Slots) + shield.\nWeapons (roll 1d6 twice):\n1 Dagger\n2–4 Lance\n5 Longsword\n6 Mace\nBasic Equipment\n3d6 Gold Pieces\nRations (3 uses)\nTorches (3 uses)\nBandages (3 uses)\ntinder box (0 slots)\nSkills\nHorsemanship\nHospitality (may request food and shelter from any of the noble houses)\nMagician\nd6 HP\n__Starting equipment\nWeapon (roll 1d6): 1–3. Dagger. 4–6. Staff.\nClass items: Ritual robes(0 slots).\nBasic Items:\n3d6 Gold Pieces\nRations (3 uses)\nTorches (3 uses)\nDagger (d6)\nChalk (0 slots)\nParchment (3 uses)\ntinder box (0 slots)\n__Skills\nDetect Magic\nMagic\nOne of the following spell books, (choose one or roll d6). All spell books take up 2 slots\n1 Charms of the Fey Court: Contains the following Rank 1 spells:\nFairy Servant, Ingratiate, Ventriloquism.\n2 Hogbrand’s Incandescence: Contains the following Rank 1 spells:\nFirelight, Ignite / Extinguish, Shield of Force.\n3 Lord Oberon’s Seals: Contains the following Rank 1 spells:\nDecipher, Glyph of Sealing, Vapours of Dream.\n4 Oliphan’s Folio: Contains the following Rank 1 spells:\nCrystal Resonance, Ioun Shard, Shield of Force.\n5 Smythe’s Illuminations: Contains the following Rank 1 spells:\nDecipher, Ignite / Extinguish, Ioun Shard.\n6 The Treatise on Force and Dissolution: Contains the following Rank 1 spells:\nCrystal Resonance, Floating Disc, Vapours of Dream.\nThief\nd6 HP\n__Starting equipment\nArmour (roll 1d6):\n1–3 None.\n4–6 Leather.\nWeapons (roll 1d6 twice):\n1 Club\n2 Three daggers\n3 Longsword\n4 Shortbow + 20 arrows.\n5 Shortsword\n6 Sling + 20 stones\nClass items: Thieves’ tools, soft-soled shoes for better sneaking\nBasic Items\n3d6 Gold pieces\nRations (3 uses)\nTorches (3 uses)\nCaltrops\nMetal spike\nGrappling hook\ntinder box (0 slots)\nSkills\nDisarm Mechanism/pick lock\npickpocket\nClimbing\nstealth\nThieves’ Cant (secret hand signals and code words)"},"Dolmenwood/Weapons":{"slug":"Dolmenwood/Weapons","filePath":"Dolmenwood/Weapons.md","title":"Weapons","links":[],"tags":[],"content":"Melee Weapons\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWeaponDamageQualitiesDagger1d6Shortsword1d6Longsword1d8Mace1d6Warhammer1d102 SlotsLance1d8Two-handed sword1d102 Slots\nRanged Weapons\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWeaponDamageQualitiesShortbow1d6Longbow1d82 SlotsCrossbow1d102 Slots - 1 action to windSling1d4"},"index":{"slug":"index","filePath":"index.md","title":"index","links":[],"tags":[],"content":""}}